"""
    原格式
    img
    anno
        {
            "07444684_2016-06-20_2": {
                'shape': [600, 733],
                'annos': [
                    {
                        'bbox': [301, 126, 440, 217],
                        'segm': array([[301, 217],
                                    [321, 208],
                                    [351, 200],
                                    [395, 207],
                                    [426, 207],
                                    [440, 204],
                                    [433, 182],
                                    [429, 164],
                                    [416, 167],
                                    [405, 167],
                                    [395, 158],
                                    [387, 145],
                                    [382, 131],
                                    [374, 126],
                                    [360, 131],
                                    [369, 144],
                                    [367, 164],
                                    [358, 178],
                                    [348, 189],
                                    [337, 183],
                                    [320, 171],
                                    [307, 180],
                                    [302, 192]]),
                        'label': 3
                    },
                    {
                        'bbox': [342, 241, 391, 280],
                        'segm': array([[368, 280],
                                    [382, 263],
                                    [391, 250],
                                    [372, 245],
                                    [356, 241],
                                    [342, 256],
                                    [344, 274]]),
                        'label': 1
                    }]}
            "07444684_2016-06-20_3": {
                'shape': [600, 733],
                'annos': [
                    {
                        'bbox': [276, 233, 345, 275],
                        'segm': array([[315, 233],
                                [291, 245],
                                [276, 262],
                                [292, 275],
                                [325, 275],
                                [345, 265],
                                [337, 246]]),
                        'label': 1
                    }, 
                    {
                        'bbox': [309, 87, 410, 215],
                        'segm': array([[336, 206],
                                    [362, 205],
                                    [390, 210],
                                    [410, 215],
                                    [410, 203],
                                    [398, 183],
                                    [387, 168],
                                    [370, 167],
                                    [358, 154],
                                    [349, 142],
                                    [345, 129],
                                    [341, 110],
                                    [336,  97],
                                    [328,  87],
                                    [315,  90],
                                    [320, 112],
                                    [322, 120],
                                    [328, 123],
                                    [328, 126],
                                    [323, 131],
                                    [325, 148],
                                    [318, 165],
                                    [311, 172],
                                    [309, 186],
                                    [312, 197],
                                    [326, 192]]), 
                        'label': 3}, 
                    {
                        'bbox': [232, 160, 287, 221],
                        'segm': array([[252, 164],
                                    [241, 180],
                                    [232, 203],
                                    [248, 221],
                                    [270, 210],
                                    [287, 198],
                                    [287, 171],
                                    [277, 160]]),
                        'label': 3
                    }]}
        }
    
    case_id 没有碘或醋酸的后缀


    目标格式
    双模态模型可能需要重新构建类
    - dual 

    直接使用现有的检测方法
    - single 可以使用coco格式
        - acid
        - iodine
"""
import os 
import pickle
import json



def convert_single():


    pass


if __name__ == "__main__":
    src_img_dir = "/data/luochunhua/cervix/cervix_det_data/img"
    src_anno_dir = "/data/luochunhua/cervix/cervix_det_data/anno/total.pkl"
    src_sil_train_path = "/data/luochunhua/cervix/cervix_det_data/data_split/sil/train.txt"
    src_sil_valid_path = "/data/luochunhua/cervix/cervix_det_data/data_split/sil/valid.txt"


    pass